cases/PR1.5/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    engineInlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    freestreamInlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    internalNozzleWall
    {
        type            calculated;
        value           nonuniform List<vector> 
38
(
(-5.71406 -0.529134 0)
(-5.71406 0 0)
(-5.71406 0 0)
(-5.71406 0 0)
(-5.71406 0 0)
(-5.71406 0 0)
(-5.71406 0 0)
(-5.71406 0 0)
...
)
;
    }
    externalNozzleWall
    {
        type            calculated;
        value           nonuniform List<vector> 
38
(
(-0.327083 0.506628 0)
(-0.327083 0 0)
(-0.327083 0 0)
(-0.327083 0 0)
(-0.327083 0 0)
(-0.327083 0 0)
(-0.327083 0 0)
(-0.327083 0 0)
...
)
;
    }
    topSlip
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    axis
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
